CSI API ETABS v1
cSapModel Properties
The cSapModel type exposes the following members.
Properties
Name | Description
Analyze
AreaElm
AreaObj
ConstraintDef
DatabaseTables
DesignCompositeBeam
DesignCompositeColumn
DesignConcrete
DesignConcreteSlab
DesignResults
DesignShearWall
DesignSteel
Detailing
Diaphragm
EditArea
EditFrame
EditGeneral
EditPoint
File
FrameObj
Func
GDispl
GridSys
GroupDef
LineElm
LinkElm
LinkObj
LoadCases
LoadPatterns
Options
PatternDef
PierLabel
PointElm
PointObj
PropArea
PropAreaSpring
PropFrame
PropLineSpring
PropLink
PropMaterial
PropPointSpring
PropRebar
PropTendon
RespCombo
Results
 Gives access to API calls related to analysis results.
SelectObj
SpandrelLabel
Story
TendonObj
Tower
View
Top
See Also
Reference
cSapModel Interface
ETABSv1 Namespace